docs/README-PT/README-PT.md
```mermaid
classDiagram
    class User {
        -UUID id
        -String name
        -String email
        -String passwordHash
        -Role role
        -Userstatus status
    }

    class Movie {
        -UUID id
        -String title
        -String director
        -Integer releaseYear
        -Set~MovieGenre~ genres
        -String synopsis
    }

    class Review {
        -UUID id
        -String content
        -BigDecimal score
        -LocalDateTime createdAt
        -LocalDateTime updatedAt
        -User author
        -Movie movie
    }
    
    class Comment{
        -UUID id
        -String content
        -LocalDateTime createdAt
        -LocalDateTime updatedAt
        -User author
        -Review review
    }   

    class ReviewLike {
        -UUID id
        -LocalDateTime createdAt
        -User user
        -Review review
    }
    
    class CommentLike {
        -UUID id
        -LocalDateTime createdAt
        -User user
        -Comment comment
    }

    class Role {
        <<enumeration>>
        USER
        ADMIN
    }
    
    class UserStatus {
        <<enumeration>>
        ACTIVE
        INACTIVE
        BANNED
    }
    
    class MovieGenre {
        <<enumeration>>
        ACTION
        ADVENTURE
        ANIMATION
        BIOGRAPHY
        COMEDY
        CRIME
        DOCUMENTARY
        DRAMA
        FAMILY
        FANTASY
        HISTORY
        HORROR
        MUSIC
        MUSICAL
        MYSTERY
        ROMANCE
        SCIENCE_FICTION
        SPORT
        THRILLER
        WAR
        WESTERN
    }

    User "1" -- "0..*" Review : Writes
    User "1" -- "0..*" ReviewLike : Likes
    User "1" -- "0..*" Comment: Writes
    User "1" -- "0..*" CommentLike: Creates
    
    Movie "1" -- "0..*" Review : Has
    Review "1" -- "0..*" Comment: Has
    Review "1" -- "0..*" ReviewLike : LikedBy
    Comment "1" -- "0..*" CommentLike: LikedBy
    
    %% ReviewLike unique(user, review)
    %% CommentLike unique(user, comment)
    %% Review unique(author, movie)
 
```
